[{
		"id": 1,
		"title": "Guess the",
		"title2": "Dice Roll",
		"subtitle": "A dice game",
		"img": "src\\assets\\projects\\GuessDiceRoll.jpg",
		"subImg": "src\\assets\\projects\\GuessDiceRoll.jpg",
		"desc1": "This game asks a user to guess the number rolled by two six-sided dice. If the user guesses correctly, they win. If not, they lose. After playing, the user has the option of playing again.",
		"desc2": "This game was my first exposure to Python. I used while loops, functions, if statements, and random number generators in its implementation.",
		"desc3": "",
		"githubLink": "https://github.com/seabass189/GuessTheDiceRoll",
		"githubPagesLink": ""
	},
	{
		"id": 2,
		"title": "Munch Web",
		"title2": "Application",
		"subtitle": "Student project using Django",
		"img": "src\\assets\\projects\\MunchWebApp.jpg",
		"subImg": "src\\assets\\projects\\MunchWebApp.jpg",
		"desc1": "This web application is an online food ordering app, similar to UberEats or Grubhub. A logged in user or guest should be able to enter an address, and be returned a list of restaurants ordered by distance. The user is then able to add items to their cart, edit the cart, and complete checkout. Once an order is completed, a logged in user can view it in their order history, where they can leave a review for the order.",
		"desc2": "I was the team lead for this project. This was our first experience creating a website, and we used online resources such as LinkedIn Learning for research. My team followed Scrum practices. Each Friday, we would meet the professor and decide on which tasks to complete during the next sprint. During the week, my team members and I would meet and work together on completing the tasks. The next Friday, we would review the completed tasks with the professor and decide on the next steps. This practice helped my team stay on schedule, and it allowed us to add additional features, such as integrating the Google Maps API to calculate distance between restaurants and the user's input address.",
		"desc3": "I learned about Python, the Django framework, Bootstrap, PostgreSQL, and Scrum from this project.",
		"githubLink": "https://github.com/seabass189/MunchWebApp",
		"githubPagesLink": ""
	},
	{
		"id": 3,
		"title": "Color Scheme",
		"title2": "Generator",
		"subtitle": "A web app to generate a theme",
		"img": "src\\assets\\projects\\color-scheme-generator.png",
		"subImg": "src\\assets\\projects\\color-scheme-generator.png",
		"desc1": "This JavaScript app generates a color scheme based on a chosen color. The color is chosen using a color picker. The type of scheme can be selected from the following options: Monochrome, Monochrome Dark, Monochrome Light, Analogic, Complement, Analogic Complement, Triad, Quad",
		"desc2": "This game was my first exposure to Python. I used while loops, functions, if statements, and random number generators in its implementation.",
		"desc3": "This project uses JavaScript, HTML, CSS and The Color API.",
		"githubLink": "https://github.com/seabass189/color-scheme-generator",
		"githubPagesLink": "https://seabass189.github.io/color-scheme-generator"
	},
	{
		"id": 4,
		"title": "Movie",
		"title2": "Watchlist",
		"subtitle": "Time to watch a movie!",
		"img": "src\\assets\\projects\\movie-watchlist.png",
		"subImg": "src\\assets\\projects\\movie-watchlist1.png",
		"desc1": "This is a web application that uses the Open Movie Database API to search for movies that can be added to a local watchlist. The search page allows a user to search for a movie by title. 10 results are loaded and arrows at the bottom of the page allow a user to navigate to the first, previous, next and last pages. The search is powered by the Open Movie Database API. Movies on this page can be added and removed from the watchlist.",
		"desc2": "The watchlist page allows a user to view and edit their watchlist. Movies can be removed from this page using the 'Remove' button. The watchlist is stored on the local browser storage.",
		"desc3": "This application was written using JavaScript, HTML and CSS.",
		"githubLink": "https://github.com/seabass189/movie-watchlist",
		"githubPagesLink": "https://seabass189.github.io/movie-watchlist"
	},
	{
		"id": 5,
		"title": "Competitive",
		"title2": "Dice Game",
		"subtitle": "First to 20 wins!",
		"img": "src\\assets\\projects\\dice-game.png",
		"subImg": "src\\assets\\projects\\dice-game1.png",
		"desc1": "This dice game was written using JavaScript, HTML and CSS.",
		"desc2": "Two players compete to be the first to get to 20 points. The first player rolls their dice and add the points to their score. The second player goes next, and then the players take turns. First to 20 points wins!",
		"desc3": "",
		"githubLink": "https://github.com/seabass189/dice-game",
		"githubPagesLink": "https://seabass189.github.io/dice-game"
	}
]
